[
  {
    "id": 1,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/bkash-logo-free-vector.jpg?updatedAt=1759995260756",
    "title": "Bkash",
    "companyName": "bKash Limited",
    "description": "Bangladesh's leading mobile financial service platform. Send and receive money instantly nationwide. Pay utility bills including electricity and gas. Mobile recharge for all operators. Cash out from any agent point across country. Make secure merchant payments at shops. Open savings account with interest. Apply for micro loans and insurance. Send money to bank accounts directly. Pay for online shopping and services. Use for educational institution fees. Government social security payments. Salary disbursement for organizations. Donate to charities and organizations. 24/7 customer support available. User-friendly Bengali interface. High security with PIN protection. Transaction history and statements. Available in both urban and rural areas. Trusted by over 50 million users",
    "size": 85.5,
    "reviews": 452300,
    "ratingAvg": 4.3,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 7250 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 2,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(9).png?updatedAt=1759997439003",
    "title": "Google Gemini",
    "companyName": "Google LLC",
    "description": "Advanced AI assistant powered by Google's latest technology. Generate creative content including stories and articles. Help with writing emails and professional documents. Answer complex questions with accurate information. Support for multiple languages and translations. Integration with Google Workspace and Gmail. Provide coding assistance for various programming languages. Offer image generation and editing capabilities. Real-time web search with current information. Free version with extensive features available. Premium version with advanced capabilities. Continuous learning and model improvements. Privacy-focused data handling and security. Voice interaction and conversation features. Document analysis and summarization capabilities. Educational support for students and teachers. Business solutions for enterprises and teams. Creative brainstorming and idea generation. Technical problem-solving and analysis. Regular updates with new features and improvements",
    "size": 45.2,
    "reviews": 892100,
    "ratingAvg": 4.5,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 2200 },
      { "name": "2 star", "count": 3100 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 3,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/Chrisbanks2-Cold-Fusion-Hd-Whatapp-2.128.png?updatedAt=1759995260530",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "description": "Free messaging and calling application worldwide. End-to-end encryption for all messages and calls. Send text messages to individuals and groups. Make high-quality voice calls to any country. Video calls with multiple participants simultaneously. Group chats supporting up to 1024 members. Status updates with photos and videos that disappear. Document sharing support for files up to 2GB. Cloud backup for messages and media. Business account features for companies. Dark mode for comfortable viewing in low light. Cross-platform compatibility across devices. Media sharing with high-quality compression. Location sharing with live location feature. Broadcast lists for sending messages to multiple contacts. Message reactions with emojis. Reply to specific messages in conversations. Disappearing messages for enhanced privacy. Community features for organizing groups. Regular security updates and feature improvements",
    "size": 78.9,
    "reviews": 15264800,
    "ratingAvg": 4.2,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 2500 },
      { "name": "3 star", "count": 7120 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 12000 }
    ]
  },
  {
    "id": 4,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/33d5cbb35f83f09537b33fe52b51ba30.jpg?updatedAt=1759995327076",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "description": "AI-powered conversational assistant with advanced capabilities. Natural language understanding for human-like conversations. Creative writing assistance for various content types. Problem-solving and analytical thinking support. Code writing and debugging for multiple programming languages. Language translation between numerous languages. Educational tutoring across various subjects and levels. Research assistance and information summarization. Custom instructions for personalized interactions. Voice conversations with natural speech recognition. Image analysis and detailed description generation. Document reading and content extraction. Mathematical calculation and equation solving. Scientific explanation and concept clarification. Business plan development and strategy creation. Content editing and proofreading services. Storytelling and creative idea generation. Technical documentation and manual creation. Learning resource recommendation. Continuous model improvements and updates",
    "size": 125.7,
    "reviews": 2856400,
    "ratingAvg": 4.6,
    "downloads": 25000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 8300 },
      { "name": "5 star", "count": 13000 }
    ]
  },
  {
    "id": 5,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(4).png?updatedAt=1759995260570",
    "title": "CapCut",
    "companyName": "ByteDance Ltd.",
    "description": "Professional video editing application for all skill levels. Easy-to-use interface suitable for beginners. Advanced editing features for professional creators. Rich template library with trending styles. Extensive music library with licensed tracks. Special effects including transitions and filters. Text animations with customizable fonts and colors. Sticker library with animated options. Background removal tool with AI technology. Speed control for slow motion and time-lapse. Reverse video playback capability. High-quality export up to 4K resolution. Direct sharing to social media platforms. Auto-caption generation for videos. Color correction and grading tools. Keyframe animation for precise control. Multi-layer editing for complex projects. Audio editing with voice enhancement. Collaborative editing features. Regular updates with new templates and features",
    "size": 156.3,
    "reviews": 1254800,
    "ratingAvg": 4.4,
    "downloads": 85000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 14000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 6,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/Facebook_Logo_2023.png?updatedAt=1759995260820",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "World's largest social networking platform. Connect with friends and family worldwide. Share photos, videos, and life updates. Join groups based on interests and communities. Follow pages of celebrities and brands. Marketplace for buying and selling items. Events creation and management tool. Watch original video content and shows. Play instant games without downloading. News feed with personalized content. Story feature for temporary sharing. Live video streaming to followers. Reels for short-form video content. Crisis response and safety features. Fundraising for non-profit organizations. Memory reminders from past posts. Privacy controls and audience selection. Business tools for page management. Job posting and employment features. Regular algorithm updates and improvements",
    "size": 95.8,
    "reviews": 25489600,
    "ratingAvg": 4.1,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 1500 },
      { "name": "2 star", "count": 3500 },
      { "name": "3 star", "count": 7100 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 12000 }
    ]
  },
  {
    "id": 7,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/e10e3f21d3b4e0f40b04b8fee7f40da4.jpg?updatedAt=1759995260717",
    "title": "Tik Tok",
    "companyName": "TikTok Ltd.",
    "description": "Short-form mobile video platform for creativity. Create and share 15-second to 10-minute videos. Vast music library with popular and trending songs. Special effects and filters for enhanced videos. Trending challenges and hashtag participation. Duet feature for collaborative videos. Reaction videos to respond to content. Live streaming with audience interaction. For You page with personalized content. Creator marketplace for brand partnerships. Business advertising and promotion platform. Parental control and family pairing features. Video editing tools within the app. Sound synchronization and audio effects. Green screen and AR effects. Video templates for easy creation. Analytics for creator insights. Direct messaging between users. Video download and sharing options. Regular content moderation and safety updates",
    "size": 210.5,
    "reviews": 18564200,
    "ratingAvg": 4.0,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 7150 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 11000 }
    ]
  },
  {
    "id": 8,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/transparent-social-media-logo-twitter-logo-blue-bird-on-white-1710892052810.webp?updatedAt=1759995260746",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Cloud-based instant messaging service. Fast and secure communication platform. Secret chats with self-destruct timer. Large group chats supporting up to 200,000 members. Channels for broadcasting to unlimited audiences. File sharing support for files up to 2GB. Custom themes and appearance settings. Sticker sets and custom sticker creation. Bots for automation and services. Voice and video messages. Scheduled and silent messages. Cross-platform synchronization across devices. Open API for developer integrations. No ads and completely free. Usernames instead of phone numbers. Multiple account support. Passcode and biometric lock. Message editing and deletion. Location-based chats. Regular security audits and updates",
    "size": 68.9,
    "reviews": 8521400,
    "ratingAvg": 4.7,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 7400 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 13000 }
    ]
  },
  {
    "id": 9,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/4f7489062aa5c4c112943f402d29373c.jpg?updatedAt=1759995260580",
    "title": "Cartup Online",
    "companyName": "Cartup Bangladesh",
    "description": "Bangladeshi e-commerce platform for online shopping. Wide range of products from local sellers. Grocery and daily necessities delivery. Electronics and appliances with warranty. Fashion and clothing for all ages. Home and kitchen products and utensils. Beauty and personal care items. Sports and fitness equipment. Books and stationery products. Secure payment options including cards. Cash on delivery available nationwide. Fast delivery within major cities. Customer support in Bengali language. Order tracking with real-time updates. Return and exchange policy. Regular discounts and seasonal offers. Loyalty program for regular customers. Product reviews and ratings. Wishlist and save for later features. Multiple payment method options",
    "size": 42.7,
    "reviews": 125400,
    "ratingAvg": 4.0,
    "downloads": 150000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 5500 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 10,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download.jpeg?updatedAt=1759995260588",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook's dedicated messaging application. Instant messaging with Facebook friends. High-quality voice calls worldwide. Video calls with multiple participants. Group chats for conversations with friends. Video rooms for larger gatherings. Fun filters and AR effects during calls. Message reactions with various emojis. Reply to specific messages in threads. Share photos and videos instantly. Play games during conversations. Money transfer between users in supported regions. Dark mode for comfortable viewing. Chat customization with colors and themes. Active status and typing indicators. Message requests and filtered messages. Story replies and interactions. Business messaging features. App integration with other services. Regular feature updates and improvements",
    "size": 88.3,
    "reviews": 12548600,
    "ratingAvg": 4.2,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 7300 },
      { "name": "4 star", "count": 14000 },
      { "name": "5 star", "count": 10000 }
    ]
  },
  {
    "id": 11,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download.png?updatedAt=1759995260669",
    "title": "Bigo Live-Live",
    "companyName": "BIGO Technology Pte Ltd",
    "description": "Live streaming social entertainment platform. Go live and share moments in real-time. Watch live streams from creators worldwide. Virtual gifting system to support creators. Connect with global community of users. Game streaming for mobile games. Beauty filters and special effects. Private messaging between users. Multi-guest live rooms for collaborations. Talent shows and singing competitions. Content moderation for safety. Creator monetization program. Level system for users and creators. Family system for group streaming. Hot lists and ranking system. Event participation and contests. Video posting and sharing. Recharge system for purchasing coins. Language translation in chats. Regular events and promotions",
    "size": 112.6,
    "reviews": 852400,
    "ratingAvg": 3.9,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 2500 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 7500 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 12,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(1).jpeg?updatedAt=1759995260659",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Multimedia messaging app focused on visual communication. Send disappearing photos and videos to friends. Fun filters and lenses with AR technology. Stories that last for 24 hours. Chat with friends and group conversations. Snap Map for location sharing with friends. Discover section with publisher content. Bitmoji avatar integration and customization. Memories for saving snaps privately. Spotlight for viral content discovery. Games and mini-apps within Snapchat. Scan feature for shopping and information. Voice and video calling capabilities. Snap Originals for exclusive shows. Friend emojis and best friends features. Custom stickers and GIF creation. Snapchat+ premium subscription. Camera tools and editing features. Privacy controls and ghost mode. Regular new lens and filter releases",
    "size": 135.8,
    "reviews": 4521800,
    "ratingAvg": 3.8,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 2500 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 7500 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 13,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(2).jpeg?updatedAt=1759995260533",
    "title": "Discord - Talk, Play",
    "companyName": "Discord Inc.",
    "description": "Voice, video, and text chat platform for communities. Designed initially for gaming communities. Create or join servers for various interests. Voice channels for real-time communication. Video calls with screen sharing capability. Low-latency communication for gaming. Custom emojis and server-specific stickers. Moderation tools for server management. Integrations with other apps and services. Mobile and desktop synchronization. Streamer mode for content creators. Nitro premium subscription with benefits. Server boosting for enhanced features. Activity status and custom status. File sharing in chats and channels. Server templates for easy setup. Role and permission systems. Welcome screens and onboarding. Community server features. Regular feature updates and improvements",
    "size": 76.4,
    "reviews": 2856400,
    "ratingAvg": 4.5,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 8000 },
      { "name": "2 star", "count": 6200 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 92000 },
      { "name": "5 star", "count": 16000 }
    ]
  },
  {
    "id": 14,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(1).png?updatedAt=1759995260691",
    "title": "My Airtel-Bangladesh",
    "companyName": "Airtel Bangladesh Ltd.",
    "description": "Airtel Bangladesh self-care mobile application. Manage mobile account and check balance. Recharge mobile balance instantly. Check data usage and remaining quota. Activate or deactivate service packages. Pay utility bills including electricity. View call history and usage details. Customer support and service center access. Special offers and promotional packages. Number portability service information. Roaming services and international packages. Network coverage map and signal strength. Complaint registration and tracking. Bengali language user interface. Personalized recommendations and offers. Service management and customization. Payment history and transaction records. Auto-recharge setup and management. Data pack recommendations. Regular app updates and improvements",
    "size": 38.9,
    "reviews": 125800,
    "ratingAvg": 4.1,
    "downloads": 250000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 7200 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 15,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(3).jpeg?updatedAt=1759995260428",
    "title": "Realme Community",
    "companyName": "Realme Mobile Telecommunications Ltd.",
    "description": "Official Realme community application for fans. Connect with Realme users worldwide. Get latest product announcements and news. Share tips, tricks, and user experiences. Participate in discussions and forums. Beta testing programs for new software. Product feedback and suggestion system. Latest news and software updates. Troubleshooting guides and solutions. Access to exclusive events and launches. Tech support from community experts. Software update information and changelogs. Product reviews and unboxing content. Photography contests and challenges. Feature requests and voting system. Realme event notifications and reminders. User-generated content sharing. Product comparison and specifications. Community guidelines and moderation. Regular community engagement activities",
    "size": 45.6,
    "reviews": 452100,
    "ratingAvg": 4.3,
    "downloads": 1000000,
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 11200 },
      { "name": "4 star", "count": 13000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 16,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(4).jpeg?updatedAt=1759995260706",
    "title": "YoHo",
    "companyName": "YoHo International Ltd.",
    "description": "Social entertainment platform for short videos. Short video sharing and creation community. Music and dance video content creation. Creative content with special effects. Social networking and friend connections. Live streaming with audience interaction. Virtual gifting system for creators. Trending challenges and hashtags. Content discovery algorithm. User interaction and engagement tools. Multi-language support for global users. Regular content updates and features. Video editing tools within app. Duet and collaboration features. Personalized content recommendations. Creator monetization opportunities. Event participation and contests. Privacy controls and safety features. Content moderation and reporting. Community guidelines and standards",
    "size": 98.7,
    "reviews": 452300,
    "ratingAvg": 3.7,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 16000 }
    ]
  },
  {
    "id": 17,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(5).jpeg?updatedAt=1759995260652",
    "title": "Google Meet",
    "companyName": "Google LLC",
    "description": "Video conferencing application for professional use. High-quality video meetings with clear audio. Join from any device including mobile. Schedule meetings with Google Calendar integration. Real-time captions for accessibility. Screen sharing for presentations and collaboration. Large meeting capacity for enterprises. Integration with Google Workspace. Security features and encryption. Background blur and replacement effects. Noise cancellation for clear audio. Recording and streaming capabilities. Meeting controls and host management. Waiting room and admission controls. Breakout rooms for smaller discussions. Polls and Q&A features. Hand raising and participant indicators. Mobile optimization for on-the-go use. Low bandwidth mode for poor connections. Regular updates with new features",
    "size": 52.3,
    "reviews": 2856400,
    "ratingAvg": 4.6,
    "downloads": 200000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "id": 18,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(2).png?updatedAt=1759995260379",
    "title": "Remini - AI",
    "companyName": "Bending Spoons Ltd.",
    "description": "AI-powered photo enhancement application. Enhance low-quality and pixelated photos. Restore old and damaged photographs. Improve image resolution significantly. Fix blurry images automatically. Colorize black and white photos. Portrait enhancement and beautification. Background improvement and replacement. Batch processing for multiple photos. One-tap enhancement for quick results. Before-and-after comparison view. Premium subscription with advanced features. Face enhancement and detail improvement. Noise reduction and clarity enhancement. Color correction and adjustment. Document enhancement for text clarity. Social media optimization for photos. Regular AI model improvements. User-friendly interface and controls. High-quality export options available",
    "size": 145.2,
    "reviews": 1254800,
    "ratingAvg": 4.2,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 5500 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 120000 }
    ]
  },
  {
    "id": 19,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(6).jpeg?updatedAt=1759995260540",
    "title": "Imo Beta",
    "companyName": "Imo.im",
    "description": "Video calls and messaging application. High-quality video calls with low data usage. Free international calls to other imo users. Group video calling with multiple participants. Instant text messaging with delivery status. Photo and video sharing in high quality. Status updates with temporary stories. Low data consumption for all features. End-to-end encryption for privacy. Multiple language support worldwide. User-friendly and simple interface. Regular beta features and testing. Voice messages and audio notes. File sharing for documents. Group chats with admin controls. Message reactions and replies. Dark mode for comfortable viewing. Contact synchronization. Call recording features. Regular performance improvements",
    "size": 67.8,
    "reviews": 8521400,
    "ratingAvg": 4.0,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 71500 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 13000 }
    ]
  },
  {
    "id": 20,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(3).png?updatedAt=1759995260697",
    "title": "MyBL",
    "companyName": "Banglalink Digital Communications Ltd.",
    "description": "Banglalink self-care mobile application. Manage Banglalink mobile account easily. Recharge mobile balance with multiple methods. Check data usage statistics in detail. Activate service packages and offers. Pay various utility bills conveniently. Customer care support and assistance. Special offers and promotional packages. Network coverage information and maps. Complaint management and tracking. Bengali language user interface. 24/7 service availability. Usage history and analytics. Personalized package recommendations. Auto-recharge setup options. Balance transfer between numbers. International roaming services. Value-added service management. Payment method management. Regular app updates and new features",
    "size": 41.5,
    "reviews": 185400,
    "ratingAvg": 4.2,
    "downloads": 300000,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 11150 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 13000 }
    ]
  },
  {
    "id": 21,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(7).jpeg?updatedAt=1759995260489",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Photo and video sharing social media platform. Share posts with photos and captions. Story feature for temporary 24-hour content. Discover new content and creators. Direct messaging for private conversations. IGTV for longer video content. Reels for short-form entertaining videos. Shopping features for businesses. Filters and editing options for photos. Explore page with personalized content. Live video streaming to followers. Close friends list for private sharing. Multiple account support and switching. Archive feature for old posts. Saved collections for organizing content. Activity insights and analytics. Hashtag following and discovery. Location tagging and maps. Ad creation for businesses. Regular algorithm and feature updates",
    "size": 89.6,
    "reviews": 18564200,
    "ratingAvg": 4.3,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 2500 },
      { "name": "2 star", "count": 4500 },
      { "name": "3 star", "count": 7200 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 14000 }
    ]
  },
  {
    "id": 22,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(8).jpeg?updatedAt=1759995260497",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "description": "Language learning platform with gamified approach. Learn 40+ different languages available. Game-like lessons for engaging learning. Speaking and listening practice exercises. Reading and writing skill development. Daily streak motivation system. Progress tracking and achievement system. Personalized learning path adaptation. Offline learning capability. Leaderboard and rewards system. Free version with comprehensive features. Premium version with additional benefits. Regular new courses and language additions. Pronunciation practice with speech recognition. Grammar lessons and explanations. Vocabulary building exercises. Cultural notes and context. Story-based learning modules. Review and practice sessions. Mobile and web synchronization",
    "size": 65.4,
    "reviews": 12548600,
    "ratingAvg": 4.7,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 7000 },
      { "name": "3 star", "count": 7200 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 12000 }
    ]
  },
  {
    "id": 23,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(9).jpeg?updatedAt=1759995260314",
    "title": "Ridmik Keyboard",
    "companyName": "Ridmik Labs",
    "description": "Smart Bengali keyboard application. Type in Bengali with ease and accuracy. English to Bengali transliteration system. Bengali prediction and auto-complete features. Multiple Bengali font options available. Theme customization with various colors. Emoji and sticker support. Voice typing capability for hands-free use. Clipboard manager for copied text. One-handed mode for large phones. Gesture typing for faster input. Regular dictionary updates. Number and symbol access. Multilingual support alongside Bengali. Keyboard height adjustment. Sound and vibration customization. Auto-correction and spell check. Personal dictionary management. Cloud backup for settings. Regular feature updates and improvements",
    "size": 38.9,
    "reviews": 452100,
    "ratingAvg": 4.4,
    "downloads": 1000000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 13000 }
    ]
  },
  {
    "id": 24,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/capcut-transparent-icon-free-png.webp?updatedAt=1759995260520",
    "title": "CapCut - video Editor",
    "companyName": "ByteDance Ltd.",
    "description": "Professional video editing application. Easy timeline editing interface. Rich effects library with transitions. Text animations and title designs. Music library with sound effects. Speed control for creative pacing. Background removal with AI. High-quality export options. Direct social media sharing. Templates for quick editing. Regular feature updates. Free with premium features. Multi-track editing capability. Color grading and correction. Keyframe animation control. Audio editing and mixing. Video stabilization feature. Auto-caption generation. Collaboration features. Cloud storage integration",
    "size": 158.2,
    "reviews": 1254800,
    "ratingAvg": 4.4,
    "downloads": 85000000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 12000 }
    ]
  },
  {
    "id": 25,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(10).jpeg?updatedAt=1759995260593",
    "title": "MX Player",
    "companyName": "MX Media & Entertainment",
    "description": "Video and audio player application. Play all video formats including MKV. Hardware acceleration support. Subtitle download and synchronization. Picture-in-picture mode. Background audio playback. Network streaming capability. Video compression tool. Equalizer and sound effects. Kids lock for safety. Dark theme available. Regular performance updates. Gesture controls for playback. Playlist creation and management. Video casting to TV. Sleep timer feature. Video quality adjustment. Audio boost feature. Subtitle customization. File management features",
    "size": 56.7,
    "reviews": 2856400,
    "ratingAvg": 4.3,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 7130 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 12000 }
    ]
  },
  {
    "id": 26,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(5).png?updatedAt=1759995260647",
    "title": "MY Robi",
    "companyName": "Robi Axiata Limited",
    "description": "Robi self-care mobile application. Manage Robi mobile account. Balance and data checking. Recharge and bill payment. Package activation service. Usage history details. Customer care access. Special offers and promotions. Number portability service. Roaming information. Complaint management. Bengali language interface. Personalized recommendations. Service management options. Payment history tracking. Auto-recharge setup. Data pack suggestions. Network coverage information. Value-added services. Regular app improvements",
    "size": 43.2,
    "reviews": 285400,
    "ratingAvg": 4.1,
    "downloads": 350000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 7320 },
      { "name": "4 star", "count": 8500 },
      { "name": "5 star", "count": 14000 }
    ]
  },
  {
    "id": 27,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(11).jpeg?updatedAt=1759995260747",
    "title": "PLAYit-All",
    "companyName": "PLAYit Media Player",
    "description": "All format media player application. Play videos and music files. Subtitle support for videos. Background audio playing. Video download feature. File management tools. Private folder security. Cast to TV capability. Video compression option. Equalizer and sound effects. Multiple theme options. Regular format updates. Gesture controls. Playlist management. Video editing features. Audio extraction from videos. Network streaming support. Sleep timer function. Video player customization. Regular feature additions",
    "size": 48.9,
    "reviews": 452300,
    "ratingAvg": 4.0,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 12000 }
    ]
  },
  {
    "id": 28,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(12).jpeg?updatedAt=1759995260525",
    "title": "Opera Mini",
    "companyName": "Opera Software AS",
    "description": "Fast web browser application. Data compression technology. Fast page loading speed. Offline reading mode. Ad blocker feature. Private browsing mode. News and content discovery. Video download capability. Battery saving mode. Multiple language support. Bookmark synchronization. Low data consumption. Data savings statistics. Night mode feature. Search engine options. Download manager. Tab management. History and bookmark backup. Custom start page. Regular security updates",
    "size": 35.8,
    "reviews": 1254800,
    "ratingAvg": 4.2,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 7200 },
      { "name": "4 star", "count": 1100 },
      { "name": "5 star", "count": 13000 }
    ]
  },
  {
    "id": 29,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(6).png?updatedAt=1759995260611",
    "title": "Linkkdln",
    "companyName": "Microsoft Corporation",
    "description": "Professional networking platform. Connect with professionals worldwide. Job search and applications. Company page following. Professional content sharing. Skill development courses. Recruitment and hiring tools. Industry news updates. Messaging and networking features. Profile optimization tips. Career guidance resources. Business opportunity finding. Professional endorsements. Recommendation system. Event creation and participation. Content publishing platform. Learning and development resources. Salary insights and comparisons. Company reviews and ratings. Regular feature enhancements",
    "size": 72.4,
    "reviews": 2856400,
    "ratingAvg": 4.4,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 9000 },
      { "name": "3 star", "count": 7280 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 13000 }
    ]
  },
  {
    "id": 30,
    "image": "https://ik.imagekit.io/2o23yla4n/assignment-8/download%20(14).jpeg?updatedAt=1759995260665",
    "title": "Nagad",
    "companyName": "Nagad Limited",
    "description": "Digital financial service platform. Send and receive money instantly. Mobile recharge and bill payments. Cash out from agent points. Merchant payments at shops. Savings account facility. Loan services available. Insurance products offered. Government services access. 24/7 customer support. Bengali language interface. Nationwide service coverage. Transaction history tracking. Balance inquiry features. Fund transfer between accounts. Educational institution payments. Utility bill payments. Social security disbursements. Business payment solutions. Regular service improvements",
    "size": 82.1,
    "reviews": 325400,
    "ratingAvg": 4.2,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 12000 }
    ]
  }
]
